In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
import matplotlib.pyplot as plt

In [4]:
from pandas import Series, DataFrame

In [5]:
s = Series(np.random.randint(0, 150, size=10), index=list('abcdefhijk'), name='python')

In [6]:
s

a     97
b     41
c      8
d    115
e      3
f    133
h     90
i    110
j    133
k     59
Name: python, dtype: int32

In [7]:
s2 = Series({'A': 100, 'B': 137, 'C': 111})

In [8]:
s2

A    100
B    137
C    111
dtype: int64

In [9]:
type(s)

pandas.core.series.Series

In [10]:
s['d']

115

In [11]:
s[['d', 'e']]

d    115
e      3
Name: python, dtype: int32

In [12]:
s[2]

8

In [13]:
s

a     97
b     41
c      8
d    115
e      3
f    133
h     90
i    110
j    133
k     59
Name: python, dtype: int32

In [14]:
s.iloc[[0, 2]]

a    97
c     8
Name: python, dtype: int32

In [15]:
s.iloc[1:3]

b    41
c     8
Name: python, dtype: int32

In [16]:
s.loc['a']

97

In [17]:
s.shape

(10,)

In [18]:
s.size

10

In [19]:
s.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'h', 'i', 'j', 'k'], dtype='object')

In [20]:
s.values

array([ 97,  41,   8, 115,   3, 133,  90, 110, 133,  59])

In [21]:
 s.head()

a     97
b     41
c      8
d    115
e      3
Name: python, dtype: int32

In [22]:
s.tail()

f    133
h     90
i    110
j    133
k     59
Name: python, dtype: int32

In [23]:
s[['d', 'j']] = np.NaN

In [24]:
s

a     97.0
b     41.0
c      8.0
d      NaN
e      3.0
f    133.0
h     90.0
i    110.0
j      NaN
k     59.0
Name: python, dtype: float64

In [25]:
s.isnull()

a    False
b    False
c    False
d     True
e    False
f    False
h    False
i    False
j     True
k    False
Name: python, dtype: bool

In [26]:
cond = s.isnull()
s[cond]

d   NaN
j   NaN
Name: python, dtype: float64

In [27]:
cond = s.notnull()
s[cond]

a     97.0
b     41.0
c      8.0
e      3.0
f    133.0
h     90.0
i    110.0
k     59.0
Name: python, dtype: float64

In [28]:
s2

A    100
B    137
C    111
dtype: int64

In [29]:
s2.name

In [30]:
s2.name = 'Math'

In [31]:
s2

A    100
B    137
C    111
Name: Math, dtype: int64

In [32]:
s

a     97.0
b     41.0
c      8.0
d      NaN
e      3.0
f    133.0
h     90.0
i    110.0
j      NaN
k     59.0
Name: python, dtype: float64

In [33]:
s + 10

a    107.0
b     51.0
c     18.0
d      NaN
e     13.0
f    143.0
h    100.0
i    120.0
j      NaN
k     69.0
Name: python, dtype: float64

In [34]:
s3 = s.add(10, fill_value=0)

In [35]:
s3

a    107.0
b     51.0
c     18.0
d     10.0
e     13.0
f    143.0
h    100.0
i    120.0
j     10.0
k     69.0
Name: python, dtype: float64

In [36]:
s3.astype(np.uint8)

a    107
b     51
c     18
d     10
e     13
f    143
h    100
i    120
j     10
k     69
Name: python, dtype: uint8

In [37]:
s.mean()

67.625

In [38]:
s.median()

74.5

In [39]:
s.max()

133.0

In [40]:
s.std()

47.731204228919864

In [41]:
s.pow(2, fill_value=2)

a     9409.0
b     1681.0
c       64.0
d        4.0
e        9.0
f    17689.0
h     8100.0
i    12100.0
j        4.0
k     3481.0
Name: python, dtype: float64

In [42]:
s.value_counts()

59.0     1
110.0    1
90.0     1
133.0    1
3.0      1
8.0      1
41.0     1
97.0     1
Name: python, dtype: int64

In [43]:
s.T

a     97.0
b     41.0
c      8.0
d      NaN
e      3.0
f    133.0
h     90.0
i    110.0
j      NaN
k     59.0
Name: python, dtype: float64

In [44]:
s

a     97.0
b     41.0
c      8.0
d      NaN
e      3.0
f    133.0
h     90.0
i    110.0
j      NaN
k     59.0
Name: python, dtype: float64

In [45]:
df = DataFrame(data={'Python': np.random.randint(0, 150, size=5), 
                     'Math': np.random.randint(0, 150, size=5),
                    'English': np.random.randint(0, 150, size=5),
                    }, index=list('ABCDE'))

In [46]:
df

   Python  Math  English
A      79   116       70
B      75    47      120
C      24   117      137
D      92    67       13
E      12    20      143

In [47]:
df2 = DataFrame(data=np.random.randint(0, 150, size=(10, 4)), index=list('ABCDEFHIJK'), columns=['Python', 'Math', 'English', 'Physic'])

In [48]:
df2

   Python  Math  English  Physic
A      89    86       26      62
B      77    82       99      79
C     120   142      104      53
D     131   131       87     137
E     142    73      127      86
F     147   121      108     143
H      16    42        7      96
I     142    26      104     111
J     118     4       93      11
K     117    93       30      35

In [49]:
df2.to_clipboard()

In [50]:
from sklearn.ensemble import RandomForestClassifier
from sklearn.datasets import load_iris

In [51]:
datasets = load_iris()

In [52]:
X, y, y_names, feature_names = datasets['data'], datasets['target'], datasets['target_names'], datasets['feature_names']

In [53]:
from sklearn.model_selection import train_test_split

In [54]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

In [55]:
clf = RandomForestClassifier()

In [56]:
clf.fit(X_train, y_train)

RandomForestClassifier()

In [57]:
y_pred = clf.predict(X_test)

In [58]:
clf.predict_proba(X_test)

array([[0.  , 0.99, 0.01],
       [0.99, 0.01, 0.  ],
       [0.  , 0.  , 1.  ],
       [0.  , 1.  , 0.  ],
       [0.  , 0.77, 0.23],
       [1.  , 0.  , 0.  ],
       [0.  , 1.  , 0.  ],
       [0.  , 0.05, 0.95],
       [0.  , 0.88, 0.12],
       [0.  , 1.  , 0.  ],
       [0.  , 0.05, 0.95],
       [1.  , 0.  , 0.  ],
       [0.94, 0.06, 0.  ],
       [1.  , 0.  , 0.  ],
       [1.  , 0.  , 0.  ],
       [0.  , 0.95, 0.05],
       [0.  , 0.  , 1.  ],
       [0.  , 1.  , 0.  ],
       [0.  , 1.  , 0.  ],
       [0.  , 0.  , 1.  ],
       [1.  , 0.  , 0.  ],
       [0.  , 0.07, 0.93],
       [1.  , 0.  , 0.  ],
       [0.  , 0.  , 1.  ],
       [0.  , 0.  , 1.  ],
       [0.  , 0.02, 0.98],
       [0.  , 0.02, 0.98],
       [0.  , 0.  , 1.  ],
       [1.  , 0.  , 0.  ],
       [1.  , 0.  , 0.  ]])

In [59]:
from sklearn.metrics import classification_report

In [60]:
output_dict = classification_report(y_test, y_pred, target_names=y_names, output_dict=True)

In [61]:
pd.DataFrame(output_dict)

           setosa  versicolor  virginica  accuracy  macro avg  weighted avg
precision     1.0         1.0        1.0       1.0        1.0           1.0
recall        1.0         1.0        1.0       1.0        1.0           1.0
f1-score      1.0         1.0        1.0       1.0        1.0           1.0
support      10.0         9.0       11.0       1.0       30.0          30.0

In [62]:
df.values

array([[ 79, 116,  70],
       [ 75,  47, 120],
       [ 24, 117, 137],
       [ 92,  67,  13],
       [ 12,  20, 143]])

In [63]:
df.columns

Index(['Python', 'Math', 'English'], dtype='object')

In [64]:
df.shape

(5, 3)

In [65]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [66]:
df.dtypes

Python     int32
Math       int32
English    int32
dtype: object

In [67]:
df2

   Python  Math  English  Physic
A      89    86       26      62
B      77    82       99      79
C     120   142      104      53
D     131   131       87     137
E     142    73      127      86
F     147   121      108     143
H      16    42        7      96
I     142    26      104     111
J     118     4       93      11
K     117    93       30      35

In [68]:
df2.Python

A     89
B     77
C    120
D    131
E    142
F    147
H     16
I    142
J    118
K    117
Name: Python, dtype: int32

In [69]:
df2[['Math', 'English']]

   Math  English
A    86       26
B    82       99
C   142      104
D   131       87
E    73      127
F   121      108
H    42        7
I    26      104
J     4       93
K    93       30

In [70]:
df2.loc['A']

Python     89
Math       86
English    26
Physic     62
Name: A, dtype: int32

In [71]:
df2.loc[['A', 'C']]

   Python  Math  English  Physic
A      89    86       26      62
C     120   142      104      53

In [72]:
df2.iloc[[3, 5]]

   Python  Math  English  Physic
D     131   131       87     137
F     147   121      108     143

In [73]:
pd.__version__

'1.1.0'

In [74]:
df2.any()

Python     True
Math       True
English    True
Physic     True
dtype: bool

In [75]:
df2.all()

Python     True
Math       True
English    True
Physic     True
dtype: bool

In [76]:
df2.var()

Python     1604.100000
Math       2057.777778
English    1716.277778
Physic     1810.455556
dtype: float64

In [77]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, A to K
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Python   10 non-null     int32
 1   Math     10 non-null     int32
 2   English  10 non-null     int32
 3   Physic   10 non-null     int32
dtypes: int32(4)
memory usage: 560.0+ bytes

In [78]:
df2.describe()

           Python        Math     English      Physic
count   10.000000   10.000000   10.000000   10.000000
mean   109.900000   80.000000   78.500000   81.300000
std     40.051217   45.362736   41.427983   42.549448
min     16.000000    4.000000    7.000000   11.000000
25%     96.000000   49.750000   44.250000   55.250000
50%    119.000000   84.000000   96.000000   82.500000
75%    139.250000  114.000000  104.000000  107.250000
max    147.000000  142.000000  127.000000  143.000000

In [79]:
df1 = DataFrame(np.random.randint(0, 150, size=(5, 3)), index=list('ABCDE'), columns=['Python', 'Math', 'English'])

In [80]:
df1

   Python  Math  English
A      54   136       88
B     144   140      102
C      36     9      121
D      65    14       35
E      36    49       29

In [81]:
df2 = DataFrame(np.random.randint(0, 150, size=(6,3)), index=list('ABCDEF'), columns=['Python', 'Math', 'English'])

In [82]:
df1 + df2

   Python   Math  English
A    93.0  254.0    164.0
B   178.0  154.0    127.0
C   159.0   16.0    168.0
D    76.0  131.0    156.0
E   153.0  121.0     62.0
F     NaN    NaN      NaN

In [83]:
df2

   Python  Math  English
A      39   118       76
B      34    14       25
C     123     7       47
D      11   117      121
E     117    72       33
F      96    88       83

In [84]:
df3 = df1.add(df2, fill_value=0)

In [85]:
df3

   Python   Math  English
A    93.0  254.0    164.0
B   178.0  154.0    127.0
C   159.0   16.0    168.0
D    76.0  131.0    156.0
E   153.0  121.0     62.0
F    96.0   88.0     83.0

In [86]:
df3.loc['A': 'E'] = df3.loc['A': 'E'] / 2

In [87]:
df3

   Python   Math  English
A    46.5  127.0     82.0
B    89.0   77.0     63.5
C    79.5    8.0     84.0
D    38.0   65.5     78.0
E    76.5   60.5     31.0
F    96.0   88.0     83.0

In [88]:
df1

   Python  Math  English
A      54   136       88
B     144   140      102
C      36     9      121
D      65    14       35
E      36    49       29

In [89]:
s1 = df1.loc['A']

In [90]:
s1

Python      54
Math       136
English     88
Name: A, dtype: int32

In [91]:
df1.add(s1)

   Python  Math  English
A     108   272      176
B     198   276      190
C      90   145      209
D     119   150      123
E      90   185      117

In [92]:
df1.add(s1, axis=0)

         Python  Math  English
A           NaN   NaN      NaN
B           NaN   NaN      NaN
C           NaN   NaN      NaN
D           NaN   NaN      NaN
E           NaN   NaN      NaN
English     NaN   NaN      NaN
Math        NaN   NaN      NaN
Python      NaN   NaN      NaN

In [93]:
df1.add(s1)

   Python  Math  English
A     108   272      176
B     198   276      190
C      90   145      209
D     119   150      123
E      90   185      117

In [94]:
df1.add(s1, axis=1)

   Python  Math  English
A     108   272      176
B     198   276      190
C      90   145      209
D     119   150      123
E      90   185      117

In [95]:
s2 = df1.Python

In [96]:
s2

A     54
B    144
C     36
D     65
E     36
Name: Python, dtype: int32

In [97]:
df1.add(s2)

    A   B   C   D   E  English  Math  Python
A NaN NaN NaN NaN NaN      NaN   NaN     NaN
B NaN NaN NaN NaN NaN      NaN   NaN     NaN
C NaN NaN NaN NaN NaN      NaN   NaN     NaN
D NaN NaN NaN NaN NaN      NaN   NaN     NaN
E NaN NaN NaN NaN NaN      NaN   NaN     NaN

In [98]:
df1.add(s2, axis=0)

   Python  Math  English
A     108   190      142
B     288   284      246
C      72    45      157
D     130    79      100
E      72    85       65

In [99]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

In [100]:
df = DataFrame(np.random.randint(0, 150, size=(150, 3)), columns=['Python', 'Math', 'English"'])

In [101]:
df

     Python  Math  English"
0        30   149        37
1         0    66        16
2        80    41       107
3        86    30        76
4        31   149        87
..      ...   ...       ...
145      72    60        30
146      83   119       126
147      86   136        52
148      31    67        77
149     110    38        91

[150 rows x 3 columns]

In [102]:
for i in range(15):
    index = np.random.randint(0, 150, size=1)[0]
    column = np.random.randint(0, 3, size=1)[0]
    df.iloc[index, column] = None

In [103]:
df

     Python   Math  English"
0      30.0  149.0      37.0
1       0.0   66.0      16.0
2      80.0   41.0     107.0
3      86.0    NaN      76.0
4      31.0  149.0      87.0
..      ...    ...       ...
145    72.0   60.0      30.0
146    83.0  119.0     126.0
147    86.0  136.0      52.0
148    31.0   67.0      77.0
149   110.0   38.0      91.0

[150 rows x 3 columns]

In [104]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Python    147 non-null    float64
 1   Math      145 non-null    float64
 2   English"  143 non-null    float64
dtypes: float64(3)
memory usage: 3.6 KB

In [105]:
df.describe()

           Python        Math    English"
count  147.000000  145.000000  143.000000
mean    80.353741   65.531034   71.237762
std     42.090542   43.064721   45.220891
min      0.000000    1.000000    0.000000
25%     51.500000   28.000000   30.500000
50%     85.000000   60.000000   70.000000
75%    113.000000  102.000000  107.000000
max    149.000000  149.000000  149.000000

In [106]:
df

     Python   Math  English"
0      30.0  149.0      37.0
1       0.0   66.0      16.0
2      80.0   41.0     107.0
3      86.0    NaN      76.0
4      31.0  149.0      87.0
..      ...    ...       ...
145    72.0   60.0      30.0
146    83.0  119.0     126.0
147    86.0  136.0      52.0
148    31.0   67.0      77.0
149   110.0   38.0      91.0

[150 rows x 3 columns]

In [107]:
df.dropna()

     Python   Math  English"
0      30.0  149.0      37.0
1       0.0   66.0      16.0
2      80.0   41.0     107.0
4      31.0  149.0      87.0
5      10.0   48.0     146.0
..      ...    ...       ...
145    72.0   60.0      30.0
146    83.0  119.0     126.0
147    86.0  136.0      52.0
148    31.0   67.0      77.0
149   110.0   38.0      91.0

[135 rows x 3 columns]

In [112]:
df.drop(labels=df[(df < 60).any(axis=1)].index)

     Python   Math  English"
3      86.0    NaN      76.0
13     80.0   70.0      85.0
15     62.0   74.0     134.0
16     65.0  118.0     118.0
19    124.0  120.0      67.0
22    103.0  122.0      83.0
28     74.0   64.0      64.0
39     60.0  127.0      65.0
43    144.0  122.0     149.0
47     83.0  134.0     126.0
48     89.0  101.0       NaN
49    137.0  131.0      80.0
55     99.0  106.0       NaN
59    109.0    NaN     101.0
61     78.0  135.0     125.0
70    112.0   87.0      80.0
83    146.0   61.0     144.0
86    138.0  102.0      75.0
94     91.0   80.0     144.0
109    88.0   94.0     143.0
111   102.0   88.0     102.0
112   107.0   89.0     117.0
113    98.0   81.0     120.0
116    82.0  120.0     147.0
120   120.0  117.0      91.0
125    78.0    NaN      72.0
133   116.0   86.0      62.0
141   121.0   74.0      70.0
142   104.0  145.0      79.0
144    82.0  138.0       NaN
146    83.0  119.0     126.0

In [116]:
cond = df.mean(axis=1) < 90
index = df[cond].index

0       True
1       True
2       True
3       True
4       True
       ...
145     True
146    False
147    False
148     True
149     True
Length: 150, dtype: bool

In [121]:
cond1 = df.mean(axis=1) < 60

In [122]:
cond1

0      False
1       True
2      False
3      False
4      False
       ...
145     True
146    False
147    False
148     True
149    False
Length: 150, dtype: bool

In [124]:
cond2 = df.mean(axis=1)>100

In [125]:
cond2

0      False
1      False
2      False
3      False
4      False
       ...
145    False
146     True
147    False
148    False
149    False
Length: 150, dtype: bool

In [126]:
sum(cond2)

23

In [128]:
cond = cond1 | cond2

In [129]:
df[cond]

     Python   Math  English"
1       0.0   66.0      16.0
6       7.0   13.0     111.0
10     11.0   74.0      36.0
16     65.0  118.0     118.0
17     43.0   60.0      24.0
..      ...    ...       ...
142   104.0  145.0      79.0
144    82.0  138.0       NaN
145    72.0   60.0      30.0
146    83.0  119.0     126.0
148    31.0   67.0      77.0

[70 rows x 3 columns]

In [130]:
np.NaN + 10

nan

In [131]:
None + 10

TypeError: unsupported operand type(s) for +: 'NoneType' and 'int'

In [132]:
import pandas as pd
import numpy as np

In [133]:
from pandas import Series, DataFrame

In [135]:
s = Series(np.random.randint(0, 150, size=6), index=pd.MultiIndex.from_product([['A', 'B', 'C'], ['期中', '期末']]))

In [136]:
s

A  期中    132
   期末     53
B  期中    109
   期末      3
C  期中    133
   期末     92
dtype: int32

In [137]:
s = Series(np.random.randint(0, 150, size=6), index=pd.MultiIndex.from_arrays([['A', 'A', 'B', 'B', 'C', 'C'], ['期中', '期末', '期中', '期末', '期中', '期末']]))

In [138]:
s

A  期中     18
   期末    148
B  期中     23
   期末     14
C  期中    109
   期末     19
dtype: int32